ROOM_ID_MAP = {
    '58': '桃李斋', '61': '银桦斋', '56': '米兰斋', '54': '山茶斋',
    '59': '凌霄斋', '57': '海桐斋', '55': '红榴斋', '18118': '聚翰斋',
    '18120': '红豆斋', '18119': '紫薇斋', '7126': '风槐斋', '7603': '雨鹃斋',
    '17887': '蓬莱客舍',
    '73': '杜衡阁', '70': '文杏阁', '71': '海棠阁', '74': '辛夷阁',
    '77': '紫藤轩', '65': '紫檀轩', '66': '石楠轩', '68': '芸香阁',
    '76': '云杉轩', '75': '韵竹阁', '72': '疏影阁', '63': '木犀轩',
    '64': '丹枫轩', '67': '苏铁轩', '69': '丁香阁',
    '7724': '乔梧阁', '7725': '乔梧阁', '6876': '乔森阁', '6875': '乔森阁',
    '6122': '乔木阁', '6364': '乔木阁', '6877': '乔相阁', '6878': '乔相阁',
    '6121': '乔林阁', '6363': '乔林阁', '8147': '留学生公寓',
    '10057': '风信子', '10934': '山楂树', '10935': '胡杨林',
    '7119': '春笛', '8240': '冬筑', '8241': '冬筑', '8242': '冬筑',
    '8092': '冬筑',
}


def get_building_name(room_id: str) -> str:
    return ROOM_ID_MAP.get(str(room_id), '')
